templates/bidata/loginservice.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://www.w3.org/2005/08/addressing">
    <s:Header>
        <a:Action s:mustUnderstand="1">http://www.ultipro.com/dataservices/bidata/2/IBIDataService/LogOn</a:Action>
        <a:To s:mustUnderstand="1">https://servicehost/services/BiDataService</a:To>
    </s:Header>
    <s:Body>
        <LogOn xmlns="http://www.ultipro.com/dataservices/bidata/2">
            <logOnRequest xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
                <UserName>{{ UserName }}</UserName>
                <Password>{{ Password }}</Password>
                <ClientAccessKey>{{ ClientAccessKey }}</ClientAccessKey>
                <UserAccessKey>{{ UserAccessKey }}</UserAccessKey>
            </logOnRequest>
        </LogOn>
    </s:Body>
</s:Envelope>